In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import random

In [4]:
import os as os

# 1. Load data data_for_pandas_exercise.xlsx menjadi DataFrame.

In [5]:
downloads_dir = os.path.expanduser("~")
downloads_file_path = os.path.join(downloads_dir, 'Downloads', 'data_for_pandas_exercise.xlsx')

df = pd.read_excel(downloads_file_path)

In [6]:
df

        Nama  Umur            Kota
0      Alice  25.0        New York
1        Bob  30.0     Los Angeles
2    Charlie  22.0         Chicago
3      David  27.0         Houston
4       Emma  29.0           Miami
5      Frank   NaN         Seattle
6      Grace  20.0          Boston
7      Henry  45.0          Dallas
8   Isabella  31.0   San Francisco
9       Jack  28.0          Austin
10      Kate  24.0          Denver
11      Liam  35.0         Phoenix
12       Mia  26.0    Philadelphia
13      Noah  32.0       San Diego
14    Olivia  36.0      Washington
15     Peter  21.0         Atlanta
16     Quinn  23.0        Portland
17    Rachel  38.0       Baltimore
18    Samuel  19.0       Las Vegas
19    Taylor  34.0       Nashville
20    Ursula  37.0     Minneapolis
21    Victor  40.0     New Orleans
22     Wendy  39.0         Orlando
23    Xavier  42.0  Salt Lake City
24      Yara  43.0           Tampa
25   Zachary  44.0     Albuquerque
26       Ava  18.0         Detroit
27  Benjamin   NaN       Charlotte
28     Chloe  27.0    Indianapolis
29    Daniel  25.0        Columbus
30     Emily  22.0    Jacksonville
31     Fiona  31.0     Kansas City
32    George  30.0       Milwaukee
33    Hannah  24.0   Oklahoma City
34     Isaac   NaN         Memphis
35     Julia  26.0      Louisville
36     Kevin  21.0           Omaha
37      Lily  33.0         Raleigh
38   Matthew  35.0       Cleveland
39      Nora  37.0      Pittsburgh
40     Oscar  39.0      Cincinnati
41  Penelope  41.0         Buffalo
42    Quincy  20.0        Hartford
43   Rebecca  42.0        Richmond
44   Stephen  36.0          Austin
45      Tara  32.0     San Antonio
46   Ulysses  34.0        San Jose
47    Violet  38.0      Sacramento
48   William  23.0       Anchorage
49    Xander  19.0        Honolulu

# 2. Tampilkan 3 baris terakhir dari DataFrame.

In [7]:
last_3_rows = df.tail(3)

print(last_3_rows)

       Nama  Umur        Kota
47   Violet  38.0  Sacramento
48  William  23.0   Anchorage
49   Xander  19.0    Honolulu

# 3. Isi nilai yang hilang/missing values dalam kolom Umur dengan median umur.

In [9]:
median_umur = df['Umur'].median()

df['Umur'].fillna(median_umur, inplace=True)

In [10]:
print(df)

        Nama  Umur            Kota
0      Alice  25.0        New York
1        Bob  30.0     Los Angeles
2    Charlie  22.0         Chicago
3      David  27.0         Houston
4       Emma  29.0           Miami
5      Frank  31.0         Seattle
6      Grace  20.0          Boston
7      Henry  45.0          Dallas
8   Isabella  31.0   San Francisco
9       Jack  28.0          Austin
10      Kate  24.0          Denver
11      Liam  35.0         Phoenix
12       Mia  26.0    Philadelphia
13      Noah  32.0       San Diego
14    Olivia  36.0      Washington
15     Peter  21.0         Atlanta
16     Quinn  23.0        Portland
17    Rachel  38.0       Baltimore
18    Samuel  19.0       Las Vegas
19    Taylor  34.0       Nashville
20    Ursula  37.0     Minneapolis
21    Victor  40.0     New Orleans
22     Wendy  39.0         Orlando
23    Xavier  42.0  Salt Lake City
24      Yara  43.0           Tampa
25   Zachary  44.0     Albuquerque
26       Ava  18.0         Detroit
27  Benjamin  31.0       Charlotte
28     Chloe  27.0    Indianapolis
29    Daniel  25.0        Columbus
30     Emily  22.0    Jacksonville
31     Fiona  31.0     Kansas City
32    George  30.0       Milwaukee
33    Hannah  24.0   Oklahoma City
34     Isaac  31.0         Memphis
35     Julia  26.0      Louisville
36     Kevin  21.0           Omaha
37      Lily  33.0         Raleigh
38   Matthew  35.0       Cleveland
39      Nora  37.0      Pittsburgh
40     Oscar  39.0      Cincinnati
41  Penelope  41.0         Buffalo
42    Quincy  20.0        Hartford
43   Rebecca  42.0        Richmond
44   Stephen  36.0          Austin
45      Tara  32.0     San Antonio
46   Ulysses  34.0        San Jose
47    Violet  38.0      Sacramento
48   William  23.0       Anchorage
49    Xander  19.0        Honolulu

# 4. Tampilkan statistik ringkasan untuk kolom Umur.

In [11]:
umur_summary = df['Umur'].describe()

print(umur_summary)

count    50.000000
mean     30.720000
std       7.543182
min      18.000000
25%      24.250000
50%      31.000000
75%      36.750000
max      45.000000
Name: Umur, dtype: float64

# 5. Pilih dan tampilkan hanya baris-baris di mana Umur kurang dari 30.

In [12]:
young_rows = df[df['Umur'] <30]

print(young_rows)

       Nama  Umur           Kota
0     Alice  25.0       New York
2   Charlie  22.0        Chicago
3     David  27.0        Houston
4      Emma  29.0          Miami
6     Grace  20.0         Boston
9      Jack  28.0         Austin
10     Kate  24.0         Denver
12      Mia  26.0   Philadelphia
15    Peter  21.0        Atlanta
16    Quinn  23.0       Portland
18   Samuel  19.0      Las Vegas
26      Ava  18.0        Detroit
28    Chloe  27.0   Indianapolis
29   Daniel  25.0       Columbus
30    Emily  22.0   Jacksonville
33   Hannah  24.0  Oklahoma City
35    Julia  26.0     Louisville
36    Kevin  21.0          Omaha
42   Quincy  20.0       Hartford
48  William  23.0      Anchorage
49   Xander  19.0       Honolulu

# 6. Pilih dan tampilkan hanya baris-baris di mana Nama berwalan huruf P atau Q dan Umur dari 20 - 30 tahun

In [13]:
name_kondisi = df['Nama'].str.startswith(('P', 'Q'))
age_kondisi = (df['Umur'] >=20) & (df['Umur'] <= 30)
selected_rows = df[name_kondisi & age_kondisi]

print(selected_rows)

      Nama  Umur      Kota
15   Peter  21.0   Atlanta
16   Quinn  23.0  Portland
42  Quincy  20.0  Hartford

# 7. Hitung jumlah kemunculan masing-masing nilai unik dalam kolom Kota.

In [14]:
city_counts = df['Kota'].value_counts()

print(city_counts)

Austin            2
New York          1
Raleigh           1
Charlotte         1
Indianapolis      1
Columbus          1
Jacksonville      1
Kansas City       1
Milwaukee         1
Oklahoma City     1
Memphis           1
Louisville        1
Omaha             1
Cleveland         1
Albuquerque       1
Pittsburgh        1
Cincinnati        1
Buffalo           1
Hartford          1
Richmond          1
San Antonio       1
San Jose          1
Sacramento        1
Anchorage         1
Detroit           1
Tampa             1
Los Angeles       1
Philadelphia      1
Chicago           1
Houston           1
Miami             1
Seattle           1
Boston            1
Dallas            1
San Francisco     1
Denver            1
Phoenix           1
San Diego         1
Salt Lake City    1
Washington        1
Atlanta           1
Portland          1
Baltimore         1
Las Vegas         1
Nashville         1
Minneapolis       1
New Orleans       1
Orlando           1
Honolulu          1
Name: Kota, dtype: int64

# 8. Tambahkan kolom baru bernama Jenis Kelamin dengan nilai acak "Laki-laki" dan "Perempuan".

In [15]:
def generate_gender():
    return random.choice(["Laki-laki", "Perempuan"])

df['Jenis Kelamin'] = [generate_gender() for _ in range(len(df))]

print(df)

        Nama  Umur            Kota Jenis Kelamin
0      Alice  25.0        New York     Laki-laki
1        Bob  30.0     Los Angeles     Perempuan
2    Charlie  22.0         Chicago     Laki-laki
3      David  27.0         Houston     Perempuan
4       Emma  29.0           Miami     Perempuan
5      Frank  31.0         Seattle     Perempuan
6      Grace  20.0          Boston     Perempuan
7      Henry  45.0          Dallas     Laki-laki
8   Isabella  31.0   San Francisco     Laki-laki
9       Jack  28.0          Austin     Perempuan
10      Kate  24.0          Denver     Perempuan
11      Liam  35.0         Phoenix     Perempuan
12       Mia  26.0    Philadelphia     Laki-laki
13      Noah  32.0       San Diego     Laki-laki
14    Olivia  36.0      Washington     Perempuan
15     Peter  21.0         Atlanta     Laki-laki
16     Quinn  23.0        Portland     Laki-laki
17    Rachel  38.0       Baltimore     Laki-laki
18    Samuel  19.0       Las Vegas     Laki-laki
19    Taylor  34.0       Nashville     Perempuan
20    Ursula  37.0     Minneapolis     Laki-laki
21    Victor  40.0     New Orleans     Laki-laki
22     Wendy  39.0         Orlando     Perempuan
23    Xavier  42.0  Salt Lake City     Perempuan
24      Yara  43.0           Tampa     Laki-laki
25   Zachary  44.0     Albuquerque     Laki-laki
26       Ava  18.0         Detroit     Perempuan
27  Benjamin  31.0       Charlotte     Laki-laki
28     Chloe  27.0    Indianapolis     Perempuan
29    Daniel  25.0        Columbus     Perempuan
30     Emily  22.0    Jacksonville     Perempuan
31     Fiona  31.0     Kansas City     Perempuan
32    George  30.0       Milwaukee     Perempuan
33    Hannah  24.0   Oklahoma City     Perempuan
34     Isaac  31.0         Memphis     Laki-laki
35     Julia  26.0      Louisville     Laki-laki
36     Kevin  21.0           Omaha     Laki-laki
37      Lily  33.0         Raleigh     Laki-laki
38   Matthew  35.0       Cleveland     Perempuan
39      Nora  37.0      Pittsburgh     Perempuan
40     Oscar  39.0      Cincinnati     Perempuan
41  Penelope  41.0         Buffalo     Laki-laki
42    Quincy  20.0        Hartford     Laki-laki
43   Rebecca  42.0        Richmond     Laki-laki
44   Stephen  36.0          Austin     Perempuan
45      Tara  32.0     San Antonio     Perempuan
46   Ulysses  34.0        San Jose     Perempuan
47    Violet  38.0      Sacramento     Laki-laki
48   William  23.0       Anchorage     Perempuan
49    Xander  19.0        Honolulu     Laki-laki

# 9. Ganti nama kolom Kota menjadi Lokasi.

In [16]:
df.rename(columns={'Kota': 'Lokasi'}, inplace=True)

print(df)

        Nama  Umur          Lokasi Jenis Kelamin
0      Alice  25.0        New York     Laki-laki
1        Bob  30.0     Los Angeles     Perempuan
2    Charlie  22.0         Chicago     Laki-laki
3      David  27.0         Houston     Perempuan
4       Emma  29.0           Miami     Perempuan
5      Frank  31.0         Seattle     Perempuan
6      Grace  20.0          Boston     Perempuan
7      Henry  45.0          Dallas     Laki-laki
8   Isabella  31.0   San Francisco     Laki-laki
9       Jack  28.0          Austin     Perempuan
10      Kate  24.0          Denver     Perempuan
11      Liam  35.0         Phoenix     Perempuan
12       Mia  26.0    Philadelphia     Laki-laki
13      Noah  32.0       San Diego     Laki-laki
14    Olivia  36.0      Washington     Perempuan
15     Peter  21.0         Atlanta     Laki-laki
16     Quinn  23.0        Portland     Laki-laki
17    Rachel  38.0       Baltimore     Laki-laki
18    Samuel  19.0       Las Vegas     Laki-laki
19    Taylor  34.0       Nashville     Perempuan
20    Ursula  37.0     Minneapolis     Laki-laki
21    Victor  40.0     New Orleans     Laki-laki
22     Wendy  39.0         Orlando     Perempuan
23    Xavier  42.0  Salt Lake City     Perempuan
24      Yara  43.0           Tampa     Laki-laki
25   Zachary  44.0     Albuquerque     Laki-laki
26       Ava  18.0         Detroit     Perempuan
27  Benjamin  31.0       Charlotte     Laki-laki
28     Chloe  27.0    Indianapolis     Perempuan
29    Daniel  25.0        Columbus     Perempuan
30     Emily  22.0    Jacksonville     Perempuan
31     Fiona  31.0     Kansas City     Perempuan
32    George  30.0       Milwaukee     Perempuan
33    Hannah  24.0   Oklahoma City     Perempuan
34     Isaac  31.0         Memphis     Laki-laki
35     Julia  26.0      Louisville     Laki-laki
36     Kevin  21.0           Omaha     Laki-laki
37      Lily  33.0         Raleigh     Laki-laki
38   Matthew  35.0       Cleveland     Perempuan
39      Nora  37.0      Pittsburgh     Perempuan
40     Oscar  39.0      Cincinnati     Perempuan
41  Penelope  41.0         Buffalo     Laki-laki
42    Quincy  20.0        Hartford     Laki-laki
43   Rebecca  42.0        Richmond     Laki-laki
44   Stephen  36.0          Austin     Perempuan
45      Tara  32.0     San Antonio     Perempuan
46   Ulysses  34.0        San Jose     Perempuan
47    Violet  38.0      Sacramento     Laki-laki
48   William  23.0       Anchorage     Perempuan
49    Xander  19.0        Honolulu     Laki-laki

# 10. Urutkan DataFrame berdasarkan Umur secara menaik.

In [17]:
sorted_df = df.sort_values(by= 'Umur')

print(sorted_df)

        Nama  Umur          Lokasi Jenis Kelamin
26       Ava  18.0         Detroit     Perempuan
49    Xander  19.0        Honolulu     Laki-laki
18    Samuel  19.0       Las Vegas     Laki-laki
42    Quincy  20.0        Hartford     Laki-laki
6      Grace  20.0          Boston     Perempuan
36     Kevin  21.0           Omaha     Laki-laki
15     Peter  21.0         Atlanta     Laki-laki
2    Charlie  22.0         Chicago     Laki-laki
30     Emily  22.0    Jacksonville     Perempuan
48   William  23.0       Anchorage     Perempuan
16     Quinn  23.0        Portland     Laki-laki
33    Hannah  24.0   Oklahoma City     Perempuan
10      Kate  24.0          Denver     Perempuan
29    Daniel  25.0        Columbus     Perempuan
0      Alice  25.0        New York     Laki-laki
12       Mia  26.0    Philadelphia     Laki-laki
35     Julia  26.0      Louisville     Laki-laki
3      David  27.0         Houston     Perempuan
28     Chloe  27.0    Indianapolis     Perempuan
9       Jack  28.0          Austin     Perempuan
4       Emma  29.0           Miami     Perempuan
32    George  30.0       Milwaukee     Perempuan
1        Bob  30.0     Los Angeles     Perempuan
34     Isaac  31.0         Memphis     Laki-laki
31     Fiona  31.0     Kansas City     Perempuan
5      Frank  31.0         Seattle     Perempuan
8   Isabella  31.0   San Francisco     Laki-laki
27  Benjamin  31.0       Charlotte     Laki-laki
45      Tara  32.0     San Antonio     Perempuan
13      Noah  32.0       San Diego     Laki-laki
37      Lily  33.0         Raleigh     Laki-laki
46   Ulysses  34.0        San Jose     Perempuan
19    Taylor  34.0       Nashville     Perempuan
11      Liam  35.0         Phoenix     Perempuan
38   Matthew  35.0       Cleveland     Perempuan
14    Olivia  36.0      Washington     Perempuan
44   Stephen  36.0          Austin     Perempuan
20    Ursula  37.0     Minneapolis     Laki-laki
39      Nora  37.0      Pittsburgh     Perempuan
17    Rachel  38.0       Baltimore     Laki-laki
47    Violet  38.0      Sacramento     Laki-laki
22     Wendy  39.0         Orlando     Perempuan
40     Oscar  39.0      Cincinnati     Perempuan
21    Victor  40.0     New Orleans     Laki-laki
41  Penelope  41.0         Buffalo     Laki-laki
23    Xavier  42.0  Salt Lake City     Perempuan
43   Rebecca  42.0        Richmond     Laki-laki
24      Yara  43.0           Tampa     Laki-laki
25   Zachary  44.0     Albuquerque     Laki-laki
7      Henry  45.0          Dallas     Laki-laki

# 11. Ganti semua nilai "New York" dalam kolom Lokasi dengan "NYC".

In [18]:
df['Lokasi'].replace("New York", "NYC", inplace=True)

print(df)

        Nama  Umur          Lokasi Jenis Kelamin
0      Alice  25.0             NYC     Laki-laki
1        Bob  30.0     Los Angeles     Perempuan
2    Charlie  22.0         Chicago     Laki-laki
3      David  27.0         Houston     Perempuan
4       Emma  29.0           Miami     Perempuan
5      Frank  31.0         Seattle     Perempuan
6      Grace  20.0          Boston     Perempuan
7      Henry  45.0          Dallas     Laki-laki
8   Isabella  31.0   San Francisco     Laki-laki
9       Jack  28.0          Austin     Perempuan
10      Kate  24.0          Denver     Perempuan
11      Liam  35.0         Phoenix     Perempuan
12       Mia  26.0    Philadelphia     Laki-laki
13      Noah  32.0       San Diego     Laki-laki
14    Olivia  36.0      Washington     Perempuan
15     Peter  21.0         Atlanta     Laki-laki
16     Quinn  23.0        Portland     Laki-laki
17    Rachel  38.0       Baltimore     Laki-laki
18    Samuel  19.0       Las Vegas     Laki-laki
19    Taylor  34.0       Nashville     Perempuan
20    Ursula  37.0     Minneapolis     Laki-laki
21    Victor  40.0     New Orleans     Laki-laki
22     Wendy  39.0         Orlando     Perempuan
23    Xavier  42.0  Salt Lake City     Perempuan
24      Yara  43.0           Tampa     Laki-laki
25   Zachary  44.0     Albuquerque     Laki-laki
26       Ava  18.0         Detroit     Perempuan
27  Benjamin  31.0       Charlotte     Laki-laki
28     Chloe  27.0    Indianapolis     Perempuan
29    Daniel  25.0        Columbus     Perempuan
30     Emily  22.0    Jacksonville     Perempuan
31     Fiona  31.0     Kansas City     Perempuan
32    George  30.0       Milwaukee     Perempuan
33    Hannah  24.0   Oklahoma City     Perempuan
34     Isaac  31.0         Memphis     Laki-laki
35     Julia  26.0      Louisville     Laki-laki
36     Kevin  21.0           Omaha     Laki-laki
37      Lily  33.0         Raleigh     Laki-laki
38   Matthew  35.0       Cleveland     Perempuan
39      Nora  37.0      Pittsburgh     Perempuan
40     Oscar  39.0      Cincinnati     Perempuan
41  Penelope  41.0         Buffalo     Laki-laki
42    Quincy  20.0        Hartford     Laki-laki
43   Rebecca  42.0        Richmond     Laki-laki
44   Stephen  36.0          Austin     Perempuan
45      Tara  32.0     San Antonio     Perempuan
46   Ulysses  34.0        San Jose     Perempuan
47    Violet  38.0      Sacramento     Laki-laki
48   William  23.0       Anchorage     Perempuan
49    Xander  19.0        Honolulu     Laki-laki

# 12. Kelompokkan DataFrame berdasarkan Lokasi dan hitung median Umur di setiap kelompok. (hint: pelajari groupby dan agg/aggreate)

In [19]:
group_df = df.groupby('Lokasi').agg({'Umur': 'median'})

print(group_df)

                Umur
Lokasi
Albuquerque     44.0
Anchorage       23.0
Atlanta         21.0
Austin          32.0
Baltimore       38.0
Boston          20.0
Buffalo         41.0
Charlotte       31.0
Chicago         22.0
Cincinnati      39.0
Cleveland       35.0
Columbus        25.0
Dallas          45.0
Denver          24.0
Detroit         18.0
Hartford        20.0
Honolulu        19.0
Houston         27.0
Indianapolis    27.0
Jacksonville    22.0
Kansas City     31.0
Las Vegas       19.0
Los Angeles     30.0
Louisville      26.0
Memphis         31.0
Miami           29.0
Milwaukee       30.0
Minneapolis     37.0
NYC             25.0
Nashville       34.0
New Orleans     40.0
Oklahoma City   24.0
Omaha           21.0
Orlando         39.0
Philadelphia    26.0
Phoenix         35.0
Pittsburgh      37.0
Portland        23.0
Raleigh         33.0
Richmond        42.0
Sacramento      38.0
Salt Lake City  42.0
San Antonio     32.0
San Diego       32.0
San Francisco   31.0
San Jose        34.0
Seattle         31.0
Tampa           43.0
Washington      36.0

# 13. Buat DataFrame baru hanya dengan baris-baris di mana Umur ganjil.

In [20]:
ganjil_age_df = df[df['Umur'] % 2 != 0]

print(ganjil_age_df)

        Nama  Umur         Lokasi Jenis Kelamin
0      Alice  25.0            NYC     Laki-laki
3      David  27.0        Houston     Perempuan
4       Emma  29.0          Miami     Perempuan
5      Frank  31.0        Seattle     Perempuan
7      Henry  45.0         Dallas     Laki-laki
8   Isabella  31.0  San Francisco     Laki-laki
11      Liam  35.0        Phoenix     Perempuan
15     Peter  21.0        Atlanta     Laki-laki
16     Quinn  23.0       Portland     Laki-laki
18    Samuel  19.0      Las Vegas     Laki-laki
20    Ursula  37.0    Minneapolis     Laki-laki
22     Wendy  39.0        Orlando     Perempuan
24      Yara  43.0          Tampa     Laki-laki
27  Benjamin  31.0      Charlotte     Laki-laki
28     Chloe  27.0   Indianapolis     Perempuan
29    Daniel  25.0       Columbus     Perempuan
31     Fiona  31.0    Kansas City     Perempuan
34     Isaac  31.0        Memphis     Laki-laki
36     Kevin  21.0          Omaha     Laki-laki
37      Lily  33.0        Raleigh     Laki-laki
38   Matthew  35.0      Cleveland     Perempuan
39      Nora  37.0     Pittsburgh     Perempuan
40     Oscar  39.0     Cincinnati     Perempuan
41  Penelope  41.0        Buffalo     Laki-laki
48   William  23.0      Anchorage     Perempuan
49    Xander  19.0       Honolulu     Laki-laki

# 14. Simpan DataFrame yang sudah dimodifikasi menjadi file CSV baru.

In [ ]:
output_csv_path = os.path.join(os.path.expanduser("~"), 'Downloads', 'modified_data.csv')
df.to_csv(output_csv_path, index=False)

print("DataFrame berhasil di simpan sebagai CSV di 'Downloads'.")

# 15. Terapkan fungsi yang mengonversi nama-nama dalam kolom Nama menjadi huruf kecil.

In [21]:
df['Nama'] = df['Nama'].str.lower()

print(df)

        Nama  Umur          Lokasi Jenis Kelamin
0      alice  25.0             NYC     Laki-laki
1        bob  30.0     Los Angeles     Perempuan
2    charlie  22.0         Chicago     Laki-laki
3      david  27.0         Houston     Perempuan
4       emma  29.0           Miami     Perempuan
5      frank  31.0         Seattle     Perempuan
6      grace  20.0          Boston     Perempuan
7      henry  45.0          Dallas     Laki-laki
8   isabella  31.0   San Francisco     Laki-laki
9       jack  28.0          Austin     Perempuan
10      kate  24.0          Denver     Perempuan
11      liam  35.0         Phoenix     Perempuan
12       mia  26.0    Philadelphia     Laki-laki
13      noah  32.0       San Diego     Laki-laki
14    olivia  36.0      Washington     Perempuan
15     peter  21.0         Atlanta     Laki-laki
16     quinn  23.0        Portland     Laki-laki
17    rachel  38.0       Baltimore     Laki-laki
18    samuel  19.0       Las Vegas     Laki-laki
19    taylor  34.0       Nashville     Perempuan
20    ursula  37.0     Minneapolis     Laki-laki
21    victor  40.0     New Orleans     Laki-laki
22     wendy  39.0         Orlando     Perempuan
23    xavier  42.0  Salt Lake City     Perempuan
24      yara  43.0           Tampa     Laki-laki
25   zachary  44.0     Albuquerque     Laki-laki
26       ava  18.0         Detroit     Perempuan
27  benjamin  31.0       Charlotte     Laki-laki
28     chloe  27.0    Indianapolis     Perempuan
29    daniel  25.0        Columbus     Perempuan
30     emily  22.0    Jacksonville     Perempuan
31     fiona  31.0     Kansas City     Perempuan
32    george  30.0       Milwaukee     Perempuan
33    hannah  24.0   Oklahoma City     Perempuan
34     isaac  31.0         Memphis     Laki-laki
35     julia  26.0      Louisville     Laki-laki
36     kevin  21.0           Omaha     Laki-laki
37      lily  33.0         Raleigh     Laki-laki
38   matthew  35.0       Cleveland     Perempuan
39      nora  37.0      Pittsburgh     Perempuan
40     oscar  39.0      Cincinnati     Perempuan
41  penelope  41.0         Buffalo     Laki-laki
42    quincy  20.0        Hartford     Laki-laki
43   rebecca  42.0        Richmond     Laki-laki
44   stephen  36.0          Austin     Perempuan
45      tara  32.0     San Antonio     Perempuan
46   ulysses  34.0        San Jose     Perempuan
47    violet  38.0      Sacramento     Laki-laki
48   william  23.0       Anchorage     Perempuan
49    xander  19.0        Honolulu     Laki-laki

# 16. Hitung persentil ke-25 dari kolom Umur.

In [22]:
persentil_25 = df['Umur'].quantile(0.25)

print("Persentil ke 25 dari kolom umur adalah", persentil_25)

Persentil ke 25 dari kolom umur adalah 24.25

# 17. Hitung dan tampilkan rata-rata umur untuk setiap kombinasi unik Lokasi dan Jenis Kelamin. (hint: pelajari groupby dan agg/aggreate)

In [23]:
group_mean_age = df.groupby(['Lokasi', 'Jenis Kelamin'])['Umur'].mean().reset_index()

print(group_mean_age)

            Lokasi Jenis Kelamin  Umur
0      Albuquerque     Laki-laki  44.0
1        Anchorage     Perempuan  23.0
2          Atlanta     Laki-laki  21.0
3           Austin     Perempuan  32.0
4        Baltimore     Laki-laki  38.0
5           Boston     Perempuan  20.0
6          Buffalo     Laki-laki  41.0
7        Charlotte     Laki-laki  31.0
8          Chicago     Laki-laki  22.0
9       Cincinnati     Perempuan  39.0
10       Cleveland     Perempuan  35.0
11        Columbus     Perempuan  25.0
12          Dallas     Laki-laki  45.0
13          Denver     Perempuan  24.0
14         Detroit     Perempuan  18.0
15        Hartford     Laki-laki  20.0
16        Honolulu     Laki-laki  19.0
17         Houston     Perempuan  27.0
18    Indianapolis     Perempuan  27.0
19    Jacksonville     Perempuan  22.0
20     Kansas City     Perempuan  31.0
21       Las Vegas     Laki-laki  19.0
22     Los Angeles     Perempuan  30.0
23      Louisville     Laki-laki  26.0
24         Memphis     Laki-laki  31.0
25           Miami     Perempuan  29.0
26       Milwaukee     Perempuan  30.0
27     Minneapolis     Laki-laki  37.0
28             NYC     Laki-laki  25.0
29       Nashville     Perempuan  34.0
30     New Orleans     Laki-laki  40.0
31   Oklahoma City     Perempuan  24.0
32           Omaha     Laki-laki  21.0
33         Orlando     Perempuan  39.0
34    Philadelphia     Laki-laki  26.0
35         Phoenix     Perempuan  35.0
36      Pittsburgh     Perempuan  37.0
37        Portland     Laki-laki  23.0
38         Raleigh     Laki-laki  33.0
39        Richmond     Laki-laki  42.0
40      Sacramento     Laki-laki  38.0
41  Salt Lake City     Perempuan  42.0
42     San Antonio     Perempuan  32.0
43       San Diego     Laki-laki  32.0
44   San Francisco     Laki-laki  31.0
45        San Jose     Perempuan  34.0
46         Seattle     Perempuan  31.0
47           Tampa     Laki-laki  43.0
48      Washington     Perempuan  36.0

# 18. Hapus baris-baris duplikat berdasarkan kolom Lokasi.

In [24]:
df_no_duplicates = df.drop_duplicates(subset=['Lokasi'])

print(df_no_duplicates)

        Nama  Umur          Lokasi Jenis Kelamin
0      alice  25.0             NYC     Laki-laki
1        bob  30.0     Los Angeles     Perempuan
2    charlie  22.0         Chicago     Laki-laki
3      david  27.0         Houston     Perempuan
4       emma  29.0           Miami     Perempuan
5      frank  31.0         Seattle     Perempuan
6      grace  20.0          Boston     Perempuan
7      henry  45.0          Dallas     Laki-laki
8   isabella  31.0   San Francisco     Laki-laki
9       jack  28.0          Austin     Perempuan
10      kate  24.0          Denver     Perempuan
11      liam  35.0         Phoenix     Perempuan
12       mia  26.0    Philadelphia     Laki-laki
13      noah  32.0       San Diego     Laki-laki
14    olivia  36.0      Washington     Perempuan
15     peter  21.0         Atlanta     Laki-laki
16     quinn  23.0        Portland     Laki-laki
17    rachel  38.0       Baltimore     Laki-laki
18    samuel  19.0       Las Vegas     Laki-laki
19    taylor  34.0       Nashville     Perempuan
20    ursula  37.0     Minneapolis     Laki-laki
21    victor  40.0     New Orleans     Laki-laki
22     wendy  39.0         Orlando     Perempuan
23    xavier  42.0  Salt Lake City     Perempuan
24      yara  43.0           Tampa     Laki-laki
25   zachary  44.0     Albuquerque     Laki-laki
26       ava  18.0         Detroit     Perempuan
27  benjamin  31.0       Charlotte     Laki-laki
28     chloe  27.0    Indianapolis     Perempuan
29    daniel  25.0        Columbus     Perempuan
30     emily  22.0    Jacksonville     Perempuan
31     fiona  31.0     Kansas City     Perempuan
32    george  30.0       Milwaukee     Perempuan
33    hannah  24.0   Oklahoma City     Perempuan
34     isaac  31.0         Memphis     Laki-laki
35     julia  26.0      Louisville     Laki-laki
36     kevin  21.0           Omaha     Laki-laki
37      lily  33.0         Raleigh     Laki-laki
38   matthew  35.0       Cleveland     Perempuan
39      nora  37.0      Pittsburgh     Perempuan
40     oscar  39.0      Cincinnati     Perempuan
41  penelope  41.0         Buffalo     Laki-laki
42    quincy  20.0        Hartford     Laki-laki
43   rebecca  42.0        Richmond     Laki-laki
45      tara  32.0     San Antonio     Perempuan
46   ulysses  34.0        San Jose     Perempuan
47    violet  38.0      Sacramento     Laki-laki
48   william  23.0       Anchorage     Perempuan
49    xander  19.0        Honolulu     Laki-laki

# 19. Gunakan fungsi apply untuk mengubah semua nilai Umur menjadi string.

In [ ]:
df['Umur'] = df['Umur'].astype(int)

print(df)

In [ ]:
data_types = df.dtypes

print(data_types)

# 20. Hitung dan tampilkan usia maksimum untuk setiap Lokasi.

In [ ]:
max_umur_per_lokasi = df.groupby('Lokasi')['Umur'].max()

print(max_umur_per_lokasi)

# 21. Ganti semua kemunculan "Chicago" dalam kolom Lokasi dengan "CHI".

In [ ]:
df['Lokasi'].replace("Chicago", "CHI", inplace=True)

print(df)

# 22. Hitung persentase masing-masing nilai unik dalam kolom Lokasi.

In [ ]:
lokasi_precentages = df['Lokasi'].value_counts(normalize=True) * 100

print(lokasi_precentages)